{
	"lastVersion": "Alpha 0.2.6",
	"shortDescription": {
		"en": "Changelog:\n> - Added \"Province Sizes\" mode to display their sizes on the main map layer (the darker the color, the smaller the province)\n> - Added support for a logarithmic scale when displaying data in the \"Population\", \"Victory Points\" and \"Province Sizes\" view mods on the main map layer\n> - Added the ability to select a group of provinces, states, or regions by clicking on them with the LMB while holding SHIFT. (The numeric IDs of the selected objects will be combined into a single space-separated string and displayed in the text field at the bottom left of the program interface)\n> - Added automatic re-validation of map height-pixel values related to the province type on the same pixel when the user changes it's height. (Re-validation occurs when the user modifies height-map pixels using the \"Brush\" tool. If the new pixel value becomes valid, the warning icon for that pixel is removed. If it becomes invalid—for example, if a land province pixel is set below sea level—the warning icon reappears.)\n\nBug Fixes:\n> - Fixed incorrect re-rendering of the main map layer, which in some cases could occur when the user made changes\n> - Fixed the \"Buildings\" tool\n> - Fixed incorrect display of the “Parameter” element in the tools menu when the “Buildings” or “AI Zones” tools were selected\n> - Fixed an incorrect message about the results of execution of the auto-calculation tool that removes continent values from lake and sea provinces\n> - Fixed incorrect rendering of brush boundaries on map layers whose dimensions differ from those of the province map",
		"ru": "Список изменений:\n> - Добавлен режим отображения размера провинций на главном слое карты (чем темнее, тем меньше провинция)\n> - Добавлено использование логарифмического масштаба (шкалы) для отображения данных в режиме отображение \"Население\", \"Очки победы\" и \"Размер провинций\" на главном слое карты\n> - Добавлена возможность выделять группу провинций, областей или регионов, нажимая на них ЛКМ с зажатой кнопкой SHIFT. (Числовые ID группы выбранных объектов объединяются в одну общую строку с пробелом в виде символа-разделителя и отображаются в текстовом поле в левом нижнем углу интерфейса программы)\n> - Добавлена автоматическая повторная проверка на несовпадение значения пикселя карты высот с типом провинций в случае его изменения пользователем. (Повторная проверка выполняется, когда пользователь изменяет значения пикселя на карте высот при помощи инструмента \"Кисть\". Если новое значение пикселя станет корректным, то с этого пикселя пропадёт иконка предупреждения. Если наоборот станет некорректным, к примеру, пиксель наземной провинции будет находится ниже уровня моря, предупреждение появится вновь).\n\nСписок исправлений:\n> - Исправлена некорректная повторная отрисовка главного слоя карты, которая в некоторых случаях могла происходить при внесении изменений пользователем\n> - Исправлена некорректная работа инструмента \"Постройки\"\n> - Исправлено некорректное отображение элемента \"Параметр\" в меню инструментов при выборе инструментов \"Постройки\" и \"Зоны ИИ\"\n> - Исправлено некорректное сообщение о результатах выполнения инструмента авторасчёта, убирающего значение континента из озёрных и морских провинций\n> - Исправлено некорректное отображение границ кистей на слоях карты, размеры которых отличаются от размеров карты провинций"
	},
	"links": {
		"documentation": "https://github.com/Camilot1/HOI4ModBuilder",
		"discord": "https://discord.gg/bc4wF8PMhb",
		"telegram": "https://t.me/hoi4modbuilder"
	}
}